Revit 2027 API
BoundaryConditions.CreateLineBoundaryConditions(Document, ElementId, Curve, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
 Creates a new custom line boundary conditions within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BoundaryConditions CreateLineBoundaryConditions(
	Document doc,
	ElementId hostElemId,
	Curve curve,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus
)
Public Shared Function CreateLineBoundaryConditions (
	doc As Document,
	hostElemId As ElementId,
	curve As Curve,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double,
	X_Rotation As TranslationRotationValue,
	X_RotationSpringModulus As Double
) As BoundaryConditions
public:
static BoundaryConditions^ CreateLineBoundaryConditions(
	Document^ doc,
	ElementId^ hostElemId,
	Curve^ curve,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus
)
static member CreateLineBoundaryConditions :
        doc : Document *
        hostElemId : ElementId *
        curve : Curve *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float *
        X_Rotation : TranslationRotationValue *
        X_RotationSpringModulus : float -> BoundaryConditions
Parameters
doc Document
 The document in which to create the boundary conditions.
hostElemId ElementId
 The AnalyticalElement host element for the line boundary conditions.
curve Curve
 Curve of the boundary conditions.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation TranslationRotationValue
 A value indicating the X axis rotation option.
X_RotationSpringModulus Double
 Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Return Value
BoundaryConditions
 If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 1 - "Line". Otherwise it returns null .
Exceptions
Exception | Condition
ArgumentException |  The provided curve is not supported. -or- The input curve is not bound. -or- hostElemId is not a valid host for line boundary conditions. -or- Line boundary conditions already exist on the selected hostElemId.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
CreateLineBoundaryConditions Overload
Autodesk.Revit.DB.Structure Namespace